read_verilog -sv src/cv32e40p_verifypin_v7.v
prep -top cv32e40p_wrapper
rename -top cv32e40p_wrapper
uniquify; hierarchy -check

sim -zinit -clock clk_i -resetn rst_ni -n 74 -rstlen 3 -w
select -module cv32e40p_wrapper i:rst_ni
delete -input; setundef -undriven -one
select -clear;

write_rtlil out/cv32e40p_verifypin.il
